
#pragma once

/************************************************************************/

#include "Controller_type.h"

/************************************************************************/

namespace Controller
{
namespace Base
{

/************************************************************************/

class ControllerBase
{
//variable
protected:
	
	ControllerCommand _mem_data;
	
//function
public:
	
	ControllerBase();
	
	/* ÉfÅ[É^Çè¡ãéÇ∑ÇÈ */
	void Clear();
	
	YesNo Is_commnad_push();
};

/************************************************************************/

};
};

/************************************************************************/
