/*
 *	Timer5を使用 
 *	(164P時はTimer1を使用)
 *	オーバーフローまでは大体30分ぐらい。
 */ 

#pragma once

/************************************************************************/

#include "Timer_define.h"
#include "Timer_type.h"

/************************************************************************/

namespace Timer
{

namespace General
{

/************************************************************************/

/* 現在のカウント値を返す。 */
CountValue Read();

/* 現在のカウント値に引数の時間だけのカウント値を足した値を返す。 */
CountValue Set_counter(mSecond _measure_time_ms);

/* 引数のカウント値より現在値の方が大きいですか? */
YesNo Is_current_bigger_than(CountValue _time);

/* msをカウント値に変換する。 */
CountValue To_count_value(mSecond _measure_time_ms);

/* カウント値をmsに変換する。 */
mSecond To_ms(CountValue _time);

/************************************************************************/

//----------------------------------------------------------------------//

inline mSecond Read_ms()
{
	return To_ms(Read());
}

//----------------------------------------------------------------------//

//----------------------------------------------------------------------//

//----------------------------------------------------------------------//

/************************************************************************/

}

}

/************************************************************************/
